Table of Contents
 Class ReinfBarOnMoreEdges
Namespace
IdeaRS.OpenModel.Detail
Assembly
IdeaRS.OpenModel.dll
Representing reinforcement bar input on more edges in IDEA StatiCa Detail
[OpenModelClass(typeof(Reinforcement))]
public class ReinfBarOnMoreEdges : ReinforcementGroup
Inheritance
object
OpenObject
OpenElementId
Reinforcement
ReinforcementGroup
ReinfBarOnMoreEdges
Inherited Members
 ReinforcementGroup.Diameter
 ReinforcementGroup.NumOfBarsInLayer
 ReinforcementGroup.CoverFromSetting
 ReinforcementGroup.Cover
 ReinforcementGroup.EndsTypeBeg
 ReinforcementGroup.EndsTypeEnd
 ReinforcementGroup.DiameterOfMandrel
 Reinforcement.ReinfId
 Reinforcement.Material
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 ReinfBarOnMoreEdges()
Constructor
public ReinfBarOnMoreEdges()
Properties
 Covers
Covers
public List<double> Covers { get; set; }
Property Value
List<double>
 LengthFromFirstIntersection
Length of bar from first intersection in the direction of edge
public double LengthFromFirstIntersection { get; set; }
Property Value
double
 LengthFromLastIntersection
Length of bar from last intersection in the direction of edge
public double LengthFromLastIntersection { get; set; }
Property Value
double
 MasterComponent
Master component of reinforcement
public ReferenceElement MasterComponent { get; set; }
Property Value
ReferenceElement
 MasterEdges
Master Edges
public List<ReferenceElement> MasterEdges { get; set; }
Property Value
List<ReferenceElement>
 WholeFirstEdge
Bar is on whole length of first edge
public bool WholeFirstEdge { get; set; }
Property Value
bool
 WholeLastEdge
Bar is on whole length of last edge
public bool WholeLastEdge { get; set; }
Property Value
bool
 Edit this page